# GetPlantToolInitialized

## Description
Returns whether or not the plant tool has been initialized or not.

```pascal
FUNCTION GetPlantToolInitialized : BOOLEAN;
```

```python

def vs.GetPlantToolInitialized():
    return BOOLEAN
```

## Version
Availability: from VectorWorks 2008
## Category
* Utility